InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВключаяХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОбработкаСпециальныхЦен/Ext/Module.bsl
#Область ПубличныйИнтерфейс

// Получает цену товара для конкретного пользователя с учетом его категории специальных цен
//
// Параметры:
//  Номенклатура - CatalogRef.Номенклатура - товар, для которого нужно получить цену
//  Пользователь - CatalogRef.Пользователи - пользователь, для которого нужна цена
//
// Возвращаемое значение:
//  Number - рассчитанная цена товара
//
Функция ПолучитьЦенуДляПользователя(Номенклатура, Пользователь) Экспорт
	
	Если Не ЗначениеЗаполнено(Номенклатура) Или Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Получаем данные пользователя
	ДанныеПользователя = Новый Структура(
		"ИспользуетСпециальныеЦены,КатегорияСпециальныхЦен",
		Ложь,
		Неопределено
	);
	
	Попытка
		ДанныеПользователя.ИспользуетСпециальныеЦены = Пользователь.ИспользуетСпециальныеЦены;
		ДанныеПользователя.КатегорияСпециальныхЦен = Пользователь.КатегорияСпециальныхЦен;
	Исключение
		// Если атрибутов нет или ошибка при обращении, возвращаем 0
		Возврат 0;
	КонецПопытки;
	
	// Проверяем, использует ли пользователь специальные цены
	Если Не ДанныеПользователя.ИспользуетСпециальныеЦены Тогда
		Возврат 0;
	КонецЕсли;
	
	// Получаем категорию специальных цен пользователя
	Категория = ДанныеПользователя.КатегорияСпециальныхЦен;
	Если Не ЗначениеЗаполнено(Категория) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Получаем данные категории
	ДанныеКатегории = Новая Структура(
		"БазовыйВидЦен,ПроцентСкидки",
		Неопределено,
		0
	);
	
	Попытка
		ДанныеКатегории.БазовыйВидЦен = Категория.БазовыйВидЦен;
		ДанныеКатегории.ПроцентСкидки = Категория.ПроцентСкидки;
	Исключение
		Возврат 0;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ДанныеКатегории.БазовыйВидЦен) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Получаем базовую цену товара
	БазоваяЦена = ПолучитьБазовуюЦену(Номенклатура, ДанныеКатегории.БазовыйВидЦен);
	
	Если БазоваяЦена = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	// Рассчитываем цену с учетом скидки
	ПроцентСкидки = ДанныеКатегории.ПроцентСкидки;
	РассчитаннаяЦена = БазоваяЦена * (1 - ПроцентСкидки / 100);
	
	Возврат РассчитаннаяЦена;
	
КонецФункции

// Получает базовую цену товара из справочника цен
//
// Параметры:
//  Номенклатура - CatalogRef.Номенклатура - товар
//  ВидЦены - CatalogRef.ВидыЦен - вид цены
//
// Возвращаемое значение:
//  Number - базовая цена товара
//
Функция ПолучитьБазовуюЦену(Номенклатура, ВидЦены) Экспорт
	
	Если Не ЗначениеЗаполнено(Номенклатура) Или Не ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Запрос цены из регистра сведений ЦеныНоменклатуры
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЦеныНоменклатуры.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.Номенклатура = &Номенклатура
	|	И ЦеныНоменклатуры.ВидЦены = &ВидЦены
	|	И ЦеныНоменклатуры.Период <= &Период
	|УПОРЯДОЧИТЬ ПО
	|	ЦеныНоменклатуры.Период УБЫВ
	";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	
	Если Результат.ЕстьДанные() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Прочитать();
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Проверяет, заблокирована ли возможность изменения вида цен для пользователя
//
// Параметры:
//  Пользователь - CatalogRef.Пользователи - пользователь для проверки
//
// Возвращаемое значение:
//  Boolean - Истина, если изменение вида цен заблокировано
//
Функция ПроверитьБлокировкуИзменениявидаЦен(Пользователь) Экспорт
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		БлокировкаУстановлена = Пользователь.БлокировкаИзменяемостиВидаЦен;
		Возврат БлокировкаУстановлена;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вспомогательная функция для проверки, использует ли пользователь специальные цены
Функция ПользовательИспользуетСпециальныеЦены(Пользователь)
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Возврат Пользователь.ИспользуетСпециальныеЦены;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Вспомогательная функция для проверки, активна ли специальная цена товара
Функция ТоварИмеетСпециальнуюЦену(Номенклатура)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Категория = Номенклатура.КатегорияСпециальнойЦены;
		Возврат ЗначениеЗаполнено(Категория);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти
